software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertSpecimenWithPosition.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          availableQuantity="10.0"
                                          barcode="Bar Code ABC - child of 9"
                                          collectionStatus="Collected"
                                          identifier="0"
                                          initialQuantity="10.0"
                                          isAvailable="true"
                                          label="Label ABC - child of 9"
                                          pathologicalStatus="Not Specified"
                                          specimenClass="Fluid"
                                          specimenType="Serum"
                                          xsi:type="ns2:FluidSpecimen"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
<!--
                    <ns2:parentSpecimen>
                        <ns2:AbstractSpecimen identifier="9" xsi:type="ns2:FluidSpecimen"/>
                    </ns2:parentSpecimen>
-->

                    <ns2:specimenCharacteristics>
                        <ns2:SpecimenCharacteristics tissueSide="Left" tissueSite="Not Specified" identifier="1"/>
                    </ns2:specimenCharacteristics>

                    <ns2:specimenPosition>
                        <ns2:SpecimenPosition identifier="0">
                            <ns2:storageContainer>
                                <ns2:StorageContainer identifier="5" />
                            </ns2:storageContainer>
                        </ns2:SpecimenPosition>
                    </ns2:specimenPosition>

                    <ns2:specimenCollectionGroup>
                        <ns2:SpecimenCollectionGroup identifier="11" />
                    </ns2:specimenCollectionGroup>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>